prenaissance/pbl_iot_team6/device-soft/ESP32/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>

#include "BluetoothSerial.h"
#include <WiFi.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <PubSubClient.h>

#include <MFRC522.h>
#include <SPI.h>

#include <ESP32Time.h>

#include <LiquidCrystal_I2C.h>
#include <ESP32Servo.h>

#include <iomanip>
#include <sstream>

#include "drivers/dispenserDriver.h"
#include "drivers/lcdDriver.h"
#include "drivers/ledDriver.h"
#include "drivers/pickupSys.h"
#include "drivers/rfidDriver.h"
#include "./deviceData.h"

#define BAUD_RATE 9600

#define DD_TRANSM_SIZE 1024

#define SERVO_PIN 15

#define LED1_R 26
#define LED1_G 27

#define LED2_R 14
#define LED2_G 12

#define IR_PIN 13
#define PIEZO_PIN 32

#define I2C_ADDR 0x27
#define LCD_COLUMNS 16
#define LCD_LINES 2

#define SDA_PIN 21
#define SCL_PIN 22

#define SS_PIN 17
#define RST_PIN 4

#define BT_DEVICE "ESP32"

// Use this buffer for f-output

char outputBuffer[256];

// Device's id SRAM storage and conversion functions

uint8_t deviceIdBytes[LCD_COLUMNS];
std::string deviceIdBase64 = "";

std::string uint8_tToHexString(const uint8_t *, size_t);
std::string uuid4Format(const std::string &);

// Peripherals' drivers & managers

LiquidCrystal_I2C lcd(I2C_ADDR, LCD_COLUMNS, LCD_LINES);
static LcdDriver ld(&lcd);

#define UNRESOLVED_FAILURE -1
#define PICKUP_ARMED_IDLE 0
#define PICKUP_SUCCESS 1
#define PICKUP_FAILURE 2
#define MECHANISM_FAILURE 3

PiezoBuzzerDriver pd(PIEZO_PIN);
IR_SensDriver id(IR_PIN);

Servo motor;
static DispenserDriver dd(&motor);
static DispenceSequence ds(&dd);

static LedManager lm;

Rfid rfid;
static RfidDriver rm;

bool RFID_req;

// Device state SRAM storage and manip. functions

static DeviceData deviceData;

void saveData(JsonObject);
void checkSchedule(String);

bool dataUpd;

// BT

#define BT_TIME_UPD_REQ 0
#define BT_RFID_GET_REQ 1
#define BT_DUID_GET_REQ 2
#define BT_DATA_UPD_REQ 4
#define BT_WIFI_SET_REQ 5

static BluetoothSerial SerialBT;
String receivedMsg;

void bluetoothReqHandler(String);

// RTC

ESP32Time rtc(0);
bool timeUpd;

// WiFi

#define WIFI_CONNECT_TIMEOUT 10000

char ssid[50];
char pass[50];
unsigned long conTimer;
unsigned long lastConAtt;

// NTP & TIME

#define NTP_SERVER "pool.ntp.org"
int utcOffset;

void ntpTimeUpd();

std::string getCurrTimeFmt();
std::string getCurrDateFmt();

// MQTT

#define MQTT_SERVER "91.121.93.94"

char mqttClientId[100];

char dataTopic[100];
char telemetryTopic[100];

WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);

void mqttCallback(char *topic, byte *payload, unsigned int payloadLen)
{
    Serial.print("Message arrived [");
    Serial.print(topic);
    Serial.println("]: ");

    char serializedData[DD_TRANSM_SIZE];

    for (int i = 0; i < payloadLen; i++)
    {
        serializedData[i] = (char)payload[i];
    }

    // for (int i = payloadLen - 1; i >= 0; i--)
    // {
    //     if (serializedData[i] == '"')
    //     {
    //         serializedData[i + 1] = '\0';
    //         break;
    //     }
    // }

    sprintf(outputBuffer, "%s\n", serializedData);
    Serial.println(outputBuffer);

    // if (strcmp(topic, dataTopic) == 0)
    // {
    // DynamicJsonDocument dataJSON(DD_TRANSM_SIZE);
    // DeserializationError err = deserializeJson(dataJSON, serializedData);

    // if (err)
    // {
    //     Serial.print(F("deserializeJson() failed with code "));
    //     Serial.println(err.f_str());
    //     Serial.println("\n");

    //     return;
    // }

    // JsonObject dataObj = dataJSON["payload"];
    // saveData(dataObj);

    // dataUpd = true;
    // deviceData.status();

    // ld.accessQueue()->enqueue(LcdMsg("  Device data   ", "   uploaded!    ", 1, 2000));

    // Serial.println("Device data successfully updated\n");
    // }
}

void mqttReconnect()
{
    if (mqttClient.connect(mqttClientId))
    {
        Serial.println(" Reconnected sucessfully!");

        mqttClient.subscribe(dataTopic);
    }
    else
    {
        Serial.print(" Reconnection failed: rc=");
        Serial.print(mqttClient.state());
        Serial.println(". Retry on the next tic...");
    }
}

void setup()
{
    // INTERFACES

    Serial.begin(BAUD_RATE);
    Wire.begin();
    Wire.setPins(SDA_PIN, SCL_PIN);

    Serial.println("\n\nSetup logs:\n");

    // LCD

    ld.accessQueue()->enqueue(LcdMsg("    Setup...    ", "", 1, 1));
    ld.update();

    lcd.init();
    lcd.backlight();

    Serial.println("I. LCD setup - success\n");

    // GPIO

    pinMode(SERVO_PIN, OUTPUT);

    pinMode(LED1_R, OUTPUT);
    pinMode(LED1_G, OUTPUT);

    pinMode(LED2_R, OUTPUT);
    pinMode(LED2_G, OUTPUT);

    pinMode(IR_PIN, INPUT);
    pinMode(PIEZO_PIN, OUTPUT);

    Serial.println("II. GPIO setup - success\n");

    // Device's UUID

    esp_fill_random(deviceIdBytes, sizeof(deviceIdBytes));
    deviceIdBase64 = uuid4Format(uint8_tToHexString(deviceIdBytes, 16));
    deviceIdBase64 = "11111111-1111-1111-1111-111111111111";

    sprintf(outputBuffer, "III. Device's UUID generated: %s\n", deviceIdBase64.c_str());
    Serial.println(outputBuffer);

    // BT

    SerialBT.begin(BT_DEVICE);

    // Motor

    motor.attach(SERVO_PIN);

    Serial.println("IV. Motor pinout set up successfully\n");

    // LED-s

    lm.init(LedDriver(LED1_R, LED1_G), 0);
    lm.update(0, 0);
    lm.init(LedDriver(LED2_R, LED2_G), 1);
    lm.update(0, 1);

    Serial.println("V. LED indication system initialized successfully\n");

    // RFID

    rfid.init(SS_PIN, RST_PIN);
    rm.init(&rfid);

    Serial.println("VI. RFID manager initialized successfully\n");

    // MQTT

    stpcpy(mqttClientId, "IntelliDose:");
    strcat(mqttClientId, deviceIdBase64.c_str());

    strcpy(dataTopic, ("IntelliDose/" + deviceIdBase64 + "/dataTopic").c_str());
    strcpy(telemetryTopic, ("IntelliDose/" + deviceIdBase64 + "/telemetryTopic").c_str());

    sprintf(outputBuffer, "Data topic name: %s", dataTopic);
    Serial.println(outputBuffer);
    sprintf(telemetryTopic, "Telemetry topic name: %s\n", telemetryTopic);
    Serial.println(telemetryTopic);

    mqttClient.setBufferSize(DD_TRANSM_SIZE);
    mqttClient.setServer(MQTT_SERVER, 1883);
    mqttClient.setCallback(mqttCallback);

    Serial.println("VI. MQTT set up successfully\n");

    // FINISH

    timeUpd = false;
    dataUpd = false;
    RFID_req = false;

    conTimer = 0;

    ld.accessQueue()->enqueue(LcdMsg("     Setup      ", "   finsihed!    ", 1, 2000));
    ld.update();

    Serial.println("! Setup finished !\n");
}

void loop()
{
    Wire.begin();

    while (SerialBT.available())
    {
        char incomingChar = SerialBT.read();

        if (incomingChar != '\n')
        {
            receivedMsg += String(incomingChar);
        }
        else
        {
            bluetoothReqHandler(receivedMsg);
            receivedMsg = "";
        }
    }

    if (WiFi.status() != WL_CONNECTED)
    {
        Serial.print("No WiFi connection: ");

        if (strlen(ssid) > 0 && strlen(pass) > 0)
        {
            sprintf(outputBuffer, "attempting to connect to %s", ssid);
            Serial.println(outputBuffer);

            WiFi.mode(WIFI_STA);
            WiFi.begin(ssid, pass);

            conTimer += (millis() - lastConAtt);
            lastConAtt = millis();

            if (conTimer > WIFI_CONNECT_TIMEOUT)
            {
                memset(ssid, '\0', sizeof(ssid));
                memset(pass, '\0', sizeof(pass));

                Serial.println("WiFi connection attempt timed out... turning on BT\n");

                WiFi.disconnect(true);
                WiFi.mode(WIFI_OFF);

                SerialBT.begin(BT_DEVICE);
            }
        }
        else
        {
            Serial.println("provide WiFi details via Bluetooth");
        }
    }
    else
    {
        if (!mqttClient.connected())
        {
            Serial.print("MQTT connection lost! Attempting reconnection... ");
            mqttReconnect();
        }
        else
        {
            mqttClient.loop();
        }

        if (!timeUpd || !dataUpd)
        {
            if (!timeUpd)
            {
                Serial.println("Time is not set up!");
                ntpTimeUpd();

                std::string fmt1 = getCurrTimeFmt();
                std::string fmt2 = getCurrDateFmt();

                char line1[LCD_COLUMNS + 1];
                char line2[LCD_COLUMNS + 1];

                sprintf(line1, fmt1.c_str(), rtc.getHour(true), rtc.getMinute());
                sprintf(line2, fmt2.c_str(), rtc.getDay(), rtc.getMonth() + 1, rtc.getYear());

                Serial.println(line1);
                Serial.println(line2);
            }
            else if (!dataUpd)
            {
                // if (ld.accessQueue()->getQueueSize() == 0)
                // {
                //     ld.accessQueue()->enqueue(LcdMsg("Set up sys time ", "via application ", 1, 1));
                // }

                // ld.accessQueue()->enqueue(LcdMsg("Upload sys data ", "via application ", 1, 1));
                Serial.println("Device data is not updated!");
            }
        }
        else
        {
            if (ds.checkSeq())
            {
                ds.displaySequence();
                ds.dispence();
            }
            else if (RFID_req)
            {
                if (rm.isNewCardRead())
                {
                    rm.readUid();

                    sprintf(outputBuffer, "Requested UUID: %s\n", rm.getCachedUid());
                    Serial.println(outputBuffer);

                    String RFID_data = rm.getCachedUid();

                    String response = "\"{\"resCode\":" + String(BT_RFID_GET_REQ) + ", \"payload\":{\"rfid\":\"" + RFID_data + "\"}}\"";
                    SerialBT.println(response);

                    char line[LCD_COLUMNS + 1];
                    sprintf(line, "    %s    ", RFID_data);
                    ld.accessQueue()->enqueue(LcdMsg("   Tag read:    ", line, 1, 6000));

                    Serial.println("Responded with RFID ID read\n");

                    RFID_req = false;
                }
            }
            else if (!RFID_req)
            {
                if (rm.isNewCardRead())
                {
                    rm.readUid();

                    String RFID_data = rm.getCachedUid();

                    char line[LCD_COLUMNS + 1];
                    sprintf(line, "    %s    ", RFID_data);
                    ld.accessQueue()->enqueue(LcdMsg("   Tag read:    ", line, 1, 2000));

                    sprintf(outputBuffer, "Approached UUID: %s\n", rm.getCachedUid());
                    Serial.println(outputBuffer);

                    checkSchedule(rm.getCachedUid());
                }
            }
        }
    }

    if (id.getArmed())
    {
        id.detect();

        switch (id.check())
        {
        case PICKUP_SUCCESS:
            pd.stopBuzz();

            Serial.println("Med-s were picked up!\n");
            ld.accessQueue()->enqueue(LcdMsg(" Healthier with ", "   IntelliDose  ", 1, 5000));

            break;

        case MECHANISM_FAILURE:
            Serial.println("Mechanism failure!\n");
            ld.accessQueue()->enqueue(LcdMsg(" Mechanism fai- ", " lure reported! ", 1, 1));

            break;

        case PICKUP_FAILURE:
            pd.initBuzz();

            Serial.println("Pickup failure!\n");
            ld.accessQueue()->enqueue(LcdMsg("    Take your   ", "   medicine!    ", 1, 1));

            break;

        case UNRESOLVED_FAILURE:
            pd.stopBuzz();

            Serial.println("Unresolved failure!\n");
            ld.accessQueue()->enqueue(LcdMsg("Unresolved fai- ", " lure reported! ", 1, 1));

            break;

        default:
            break;
        }
    }

    if (rm.getCachedUid() != "")
    {
        rm.clearCachedUid();
    }

    if (ld.accessQueue()->getQueueSize() == 0)
    {
        std::string fmt1 = getCurrTimeFmt();
        std::string fmt2 = getCurrDateFmt();

        char line1[LCD_COLUMNS + 1];
        char line2[LCD_COLUMNS + 1];

        sprintf(line1, fmt1.c_str(), rtc.getHour(true), rtc.getMinute());
        sprintf(line2, fmt2.c_str(), rtc.getDay(), rtc.getMonth() + 1, rtc.getYear());

        ld.accessQueue()->enqueue(LcdMsg(line1, line2, 1, 1));
    }

    ld.update();
    pd.buzz();

    delay(500);
}

std::string getCurrTimeFmt()
{
    std::string fmt;

    bool f1 = rtc.getHour(true) < 10;
    bool f2 = rtc.getMinute() < 10;

    if (f1 && f2)
    {
        fmt = "     0%d:0%d      ";
    }
    else if (f1)
    {
        fmt = "     0%d:%d      ";
    }
    else if (f2)
    {
        fmt = "     %d:0%d      ";
    }
    else
    {
        fmt = "     %d:%d      ";
    }

    return fmt;
}

std::string getCurrDateFmt()
{
    std::string fmt;

    bool f1 = rtc.getDay() < 10;
    bool f2 = rtc.getMonth() + 1 < 10;

    if (f1 && f2)
    {
        fmt = "   0%d/0%d/%d   ";
    }
    else if (f1)
    {
        fmt = "   0%d/%d/%d   ";
    }
    else if (f2)
    {
        fmt = "   %d/0%d/%d   ";
    }
    else
    {
        fmt = "   %d/%d/%d   ";
    }

    return fmt;
}

void bluetoothReqHandler(String reqString)
{
    char serializedData[DD_TRANSM_SIZE];

    // reqString.replace(" ", "");
    reqString.replace("\n", "");
    reqString.trim();
    reqString.remove(0, 1);
    reqString.toCharArray(serializedData, DD_TRANSM_SIZE);

    DynamicJsonDocument reqJSON(DD_TRANSM_SIZE);
    DeserializationError err = deserializeJson(reqJSON, serializedData);

    if (err)
    {
        Serial.print(F("deserializeJson() failed with code "));
        Serial.println(err.f_str());
        Serial.println("\n");

        return;
    }

    int reqCode = reqJSON["reqCode"];
    JsonObject payload = reqJSON["payload"];

    switch (reqCode)
    {
    case BT_TIME_UPD_REQ:
    {
        int gmtOffset = payload["gmtOffset"];

        JsonObject date = payload["date"];
        int year = date["year"];
        int month = date["month"];
        int day = date["day"];

        JsonObject time = payload["time"];
        int hour = time["hour"];
        int minute = time["minute"];
        int second = time["second"];

        rtc.setTime(second, minute, hour, day, month, year);
        rtc.offset = gmtOffset;

        timeUpd = true;

        ld.accessQueue()->enqueue(LcdMsg("    Time upd    ", " successfully!  ", 1, 2000));

        Serial.println("Time successfully updated!");
    }
    break;

    case BT_DATA_UPD_REQ:
    {
        saveData(payload);

        dataUpd = true;
        deviceData.status();

        ld.accessQueue()->enqueue(LcdMsg("  Device data   ", "   uploaded!    ", 1, 2000));

        Serial.println("Device data successfully updated\n");
    }
    break;

    case BT_DUID_GET_REQ:
    {
        String response = "\"{\"resCode\":" + String(BT_DUID_GET_REQ) + ", \"payload\":{\"deviceIdBase64\":\"" + String(deviceIdBase64.c_str()) + "\"}}\"";
        SerialBT.println(response);

        ld.accessQueue()->enqueue(LcdMsg(" Responded with ", " device's UUID  ", 1, 2000));

        Serial.println("Responded with device's UUID\n");
    }
    break;

    case BT_RFID_GET_REQ:
    {
        RFID_req = true;

        ld.accessQueue()->enqueue(LcdMsg("  RFID reading  ", "   requested    ", 1, 2000));
        ld.accessQueue()->enqueue(LcdMsg("    Approach    ", "    your tag    ", 1, 4000));

        Serial.println("RFID reading requset detected\n");
    }
    break;

    case BT_WIFI_SET_REQ:
    {
        strcpy(ssid, payload["ssid"]);
        strcpy(pass, payload["pass"]);
        utcOffset = payload["utcOffset"];

        Serial.println("WiFi details received... shutting down BT\n");
        SerialBT.end();

        conTimer = 0;
        lastConAtt = millis();
    }
    break;

    default:
        Serial.println("Unrecognized Bluetooth request!\n");

        break;
    }
}

void checkSchedule(String userRFID)
{
    char line1[LCD_COLUMNS + 1];
    char line2[LCD_COLUMNS + 1];

    bool found = false;

    Profile *pProf = deviceData.getProfile(userRFID);

    Serial.println(pProf->getUN());

    if (pProf != nullptr)
    {
        std::string fmt = getCurrTimeFmt();
        sprintf(line1, fmt.c_str(), rtc.getHour(true), rtc.getMinute());
        sprintf(line2, "      %s      ", pProf->getUN());

        ld.accessQueue()->enqueue(LcdMsg(line1, line2, 1, 5000));

        for (int i = 0; i < pProf->getSchedLen(); i++)
        {
            ScheduleItem *pItem = pProf->getItem(i);

            if (pItem->checkTime(rtc.getHour(true), rtc.getMinute()))
            {
                if (pItem->getFulfileld())
                {
                    sprintf(outputBuffer, "%d:%d schedule item for %s  was already fulfilled today!\n", pItem->getTimeH(), pItem->getTimeM(), pProf->getUN());
                    Serial.println(outputBuffer);

                    continue;
                }
                else
                {
                    found = true;

                    PillSlot *pSlot = deviceData.getPillSlot(pItem->getSlotNum());

                    if (pSlot == nullptr)
                    {
                        Serial.println("Slot not found!");
                        continue;
                    }
                    else
                    {
                        for (int j = 0; j < pItem->getQuantity(); j++)
                        {
                            if (!pSlot->checkPillCnt())
                            {
                                sprintf(outputBuffer, "Insufficient supply in slot: %d\n", pItem->getSlotNum());
                                Serial.println(outputBuffer);

                                break;
                            }
                            else
                            {
                                ds.pushToSeq(pItem->getSlotNum());
                                id.arm();

                                pSlot->decPillCnt();
                                pItem->check();

                                sprintf(outputBuffer, "%d:%d | slot: %d\n", pItem->getTimeH(), pItem->getTimeM(), pItem->getSlotNum());
                                Serial.println(outputBuffer);
                            }
                        }

                        lm.update(pSlot->getPillCnt(), pItem->getSlotNum() - 1);
                    }
                }
            }
        }
    }

    if (!found)
    {
        Serial.println("No schedule items found!\n");
    }
}

std::string uint8_tToHexString(const uint8_t *data, size_t len)
{
    std::stringstream ss;
    ss << std::hex;

    for (size_t i = 0; i < len; ++i)
    {
        ss << std::setw(2) << std::setfill('0') << static_cast<int>(data[i]);
    }

    return ss.str();
}

std::string uuid4Format(const std::string &uuid_str)
{
    std::string formatted_uuid =
        uuid_str.substr(0, 8) + "-" +
        uuid_str.substr(8, 4) + "-" +
        uuid_str.substr(12, 4) + "-" +
        uuid_str.substr(16, 4) + "-" +
        uuid_str.substr(20);

    return formatted_uuid;
}

void ntpTimeUpd()
{
    WiFiUDP ntpUDP;
    NTPClient timeClient(ntpUDP, NTP_SERVER, 0);

    timeClient.begin();
    timeClient.update();

    unsigned long epochTime = timeClient.getEpochTime();
    struct tm *ptm = gmtime((time_t *)&epochTime);

    int year = ptm->tm_year + 1900;
    int month = ptm->tm_mon + 1;
    int day = ptm->tm_mday;
    int hour = ptm->tm_hour;
    int minute = ptm->tm_min;
    int second = ptm->tm_sec;

    rtc.setTime(second, minute, hour, day, month, year);
    rtc.offset = utcOffset;

    timeClient.end();

    timeUpd = true;
    Serial.println("Time successfully updated!");
}

void saveData(JsonObject payload)
{
    deviceData = DeviceData();

    // Record pill slots

    JsonArray pillSlots = payload["pillSlots"];
    for (JsonObject pillSlot : pillSlots)
    {
        int slotNumber = pillSlot["slotNumber"];
        const char *pillName = pillSlot["pillName"];
        int pillCount = pillSlot["pillCount"];

        Serial.println(String(slotNumber) + " " + String(pillName));

        deviceData.addPillSlot(PillSlot(pillName, pillCount), slotNumber);
        lm.update(pillCount, slotNumber - 1);
    }

    // Record profiles and their schedules

    JsonArray profiles = payload["profiles"];
    for (JsonObject profile : profiles)
    {
        const char *username = profile["username"];
        const char *RFID_UID = profile["rfid"];

        deviceData.addProfile(Profile(username, RFID_UID));

        Profile *pProf = deviceData.getProfile(String(RFID_UID));

        JsonArray pillSchedules = profile["pillSchedules"];
        for (JsonObject pillSchedule : pillSchedules)
        {
            int hour = pillSchedule["time"]["hour"];
            int minute = pillSchedule["time"]["minutes"];
            int slotNumber = pillSchedule["slotNumber"];
            int quantity = pillSchedule["quantity"];

            pProf->addItem(ScheduleItem(hour, minute, slotNumber, quantity));
        }
    }
}